; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-79)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc5)
    (at car1 loc4)
    (at car2 loc8)
    (at car3 loc8)
    (at car4 loc9)
    (at car5 loc1)
    (at car6 loc2)
    (at car7 loc4)
    (at car8 loc9)
    (at car9 loc8)
    (at car10 loc5)
    (at car11 loc10)
    (at car12 loc9)
    (at car13 loc2)
    (at car14 loc13)
    (at car15 loc4)
    (at car16 loc8)
)
 (:goal (and 
(at car1 loc10)
(at car2 loc5)
(at car3 loc7)
(at car4 loc12)
(at car5 loc4)
(at car6 loc6)
(at car7 loc13)
(at car8 loc10)
(at car9 loc10)
(at car10 loc7)
(at car11 loc2)
))
)

; plan
1. (sail loc5 loc1)
   deleted: (at-ferry loc5)
   added: (at-ferry loc1)
   goals met: 0 of 11
2. (board car5 loc1)
   deleted: (at car5 loc1) (empty-ferry)
   added: (on car5)
   goals met: 0 of 11
3. (sail loc1 loc4)
   deleted: (at-ferry loc1)
   added: (at-ferry loc4)
   goals met: 0 of 11
4. (debark car5 loc4)
   deleted: (on car5)
   added: (at car5 loc4) (empty-ferry)
   goals met: 1 of 11
5. (board car1 loc4)
   deleted: (at car1 loc4) (empty-ferry)
   added: (on car1)
   goals met: 1 of 11
6. (sail loc4 loc10)
   deleted: (at-ferry loc4)
   added: (at-ferry loc10)
   goals met: 1 of 11
7. (debark car1 loc10)
   deleted: (on car1)
   added: (at car1 loc10) (empty-ferry)
   goals met: 2 of 11
8. (board car11 loc10)
   deleted: (at car11 loc10) (empty-ferry)
   added: (on car11)
   goals met: 2 of 11
9. (sail loc10 loc2)
   deleted: (at-ferry loc10)
   added: (at-ferry loc2)
   goals met: 2 of 11
10. (debark car11 loc2)
   deleted: (on car11)
   added: (at car11 loc2) (empty-ferry)
   goals met: 3 of 11
11. (board car6 loc2)
   deleted: (at car6 loc2) (empty-ferry)
   added: (on car6)
   goals met: 3 of 11
12. (sail loc2 loc6)
   deleted: (at-ferry loc2)
   added: (at-ferry loc6)
   goals met: 3 of 11
13. (debark car6 loc6)
   deleted: (on car6)
   added: (at car6 loc6) (empty-ferry)
   goals met: 4 of 11
14. (sail loc6 loc4)
   deleted: (at-ferry loc6)
   added: (at-ferry loc4)
   goals met: 4 of 11
15. (board car7 loc4)
   deleted: (at car7 loc4) (empty-ferry)
   added: (on car7)
   goals met: 4 of 11
16. (sail loc4 loc13)
   deleted: (at-ferry loc4)
   added: (at-ferry loc13)
   goals met: 4 of 11
17. (debark car7 loc13)
   deleted: (on car7)
   added: (at car7 loc13) (empty-ferry)
   goals met: 5 of 11
18. (sail loc13 loc9)
   deleted: (at-ferry loc13)
   added: (at-ferry loc9)
   goals met: 5 of 11
19. (board car4 loc9)
   deleted: (at car4 loc9) (empty-ferry)
   added: (on car4)
   goals met: 5 of 11
20. (sail loc9 loc12)
   deleted: (at-ferry loc9)
   added: (at-ferry loc12)
   goals met: 5 of 11
21. (debark car4 loc12)
   deleted: (on car4)
   added: (at car4 loc12) (empty-ferry)
   goals met: 6 of 11
22. (sail loc12 loc8)
   deleted: (at-ferry loc12)
   added: (at-ferry loc8)
   goals met: 6 of 11
23. (board car2 loc8)
   deleted: (at car2 loc8) (empty-ferry)
   added: (on car2)
   goals met: 6 of 11
24. (sail loc8 loc5)
   deleted: (at-ferry loc8)
   added: (at-ferry loc5)
   goals met: 6 of 11
25. (debark car2 loc5)
   deleted: (on car2)
   added: (at car2 loc5) (empty-ferry)
   goals met: 7 of 11
26. (board car10 loc5)
   deleted: (at car10 loc5) (empty-ferry)
   added: (on car10)
   goals met: 7 of 11
27. (sail loc5 loc7)
   deleted: (at-ferry loc5)
   added: (at-ferry loc7)
   goals met: 7 of 11
28. (debark car10 loc7)
   deleted: (on car10)
   added: (at car10 loc7) (empty-ferry)
   goals met: 8 of 11
29. (sail loc7 loc8)
   deleted: (at-ferry loc7)
   added: (at-ferry loc8)
   goals met: 8 of 11
30. (board car3 loc8)
   deleted: (at car3 loc8) (empty-ferry)
   added: (on car3)
   goals met: 8 of 11
31. (sail loc8 loc7)
   deleted: (at-ferry loc8)
   added: (at-ferry loc7)
   goals met: 8 of 11
32. (debark car3 loc7)
   deleted: (on car3)
   added: (at car3 loc7) (empty-ferry)
   goals met: 9 of 11
33. (sail loc7 loc8)
   deleted: (at-ferry loc7)
   added: (at-ferry loc8)
   goals met: 9 of 11
34. (board car9 loc8)
   deleted: (at car9 loc8) (empty-ferry)
   added: (on car9)
   goals met: 9 of 11
35. (sail loc8 loc10)
   deleted: (at-ferry loc8)
   added: (at-ferry loc10)
   goals met: 9 of 11
36. (debark car9 loc10)
   deleted: (on car9)
   added: (at car9 loc10) (empty-ferry)
   goals met: 10 of 11
37. (sail loc10 loc9)
   deleted: (at-ferry loc10)
   added: (at-ferry loc9)
   goals met: 10 of 11
38. (board car8 loc9)
   deleted: (at car8 loc9) (empty-ferry)
   added: (on car8)
   goals met: 10 of 11
39. (sail loc9 loc10)
   deleted: (at-ferry loc9)
   added: (at-ferry loc10)
   goals met: 10 of 11
40. (debark car8 loc10)
   deleted: (on car8)
   added: (at car8 loc10) (empty-ferry)
   goals met: 11 of 11
